package dev.sixik.artisans_delight.mod.core.knot;

public enum KnotType {
    NONE,
    /**
     * Город / деревня — содержит склады, бараки, мастерские
     */
    TOWN,
    /**
     * Производственный узел — содержит под-узлы добычи (фермы, рудники, лесопилки)
     */
    PRODUCTION,
    /**
     * Путевой узел / Развилка — дешёвый узел соединения дорог без добычи
     */
    WAYPOINT,
    /**
     * Застава / Аванпост
     */
    OUTPOST,
    /**
     * Портальный узел между измерениями
     */
    PORTAL
}
